#+AUTHOR: Claudia Porto Capetillo
#+AUTHOR: Fernando Raul Rodriguez Flores

***** code
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (progn
        (bformat t "Testing binary-operators layer 2:")
        (format t "subset:~6t ~a~%"  (subset 1 2))
        (format t "not-equal:~6t ~a~%" (!= 1 2))
        (format t "belongs-to:~6t ~a~%" (in 1 2))
        )
      #+end_src

      #+RESULTS:
      : ===================================
      :  Testing binary-operators layer 2:
      : ===================================
      : 
      : subset:  (subset 1 2)
      : not-equal:  (not-equal 1 2)
      : belongs-to:  (belongs-to 1 2)

******* basic tests
        #+begin_src lisp :results output :export code :tangle src/tests.lisp
        (let* ((lang (make-instance 'infix-language)))
          (bformat t "Testing code-generation for infix-language")
          (generate-code (+  1 2) lang t) (terpri) 
          (generate-code (<  1 2) lang t) (terpri)
          (generate-code (<= 1 2) lang t) (terpri)
          (generate-code (>  1 2) lang t) (terpri)
          (generate-code (>= 1 2) lang t) (terpri)
          (generate-code (=  1 2) lang t) (terpri)
          (bformat t "Testing the addition of the extra parenthesis")
          (generate-code (+  (+ 1 1) (- 3 2)) lang t) (terpri) 
          (generate-code (<  (- 1 3) (+ 2 4)) lang t) (terpri)
          (generate-code (<= (- 1 3) (+ 2 4)) lang t) (terpri)
          (generate-code (>  (- 1 3) (+ 2 4)) lang t) (terpri)
          (generate-code (>= (- 1 3) (+ 2 4)) lang t) (terpri)
          (generate-code (=  (- 1 3) (+ 2 4)) lang t) (terpri)
          )
        #+end_src

	#+RESULTS:
	#+begin_example
	============================================
	 Testing code-generation for infix-language
	============================================

	1 + 2
	1 < 2
	1 <= 2
	1 > 2
	1 >= 2
	1 = 2
	===============================================
	 Testing the addition of the extra parenthesis
	===============================================

	1 + 1 + 3 - 2
	1 - 3 < 2 + 4
	1 - 3 <= 2 + 4
	1 - 3 > 2 + 4
	1 - 3 >= 2 + 4
	1 - 3 = 2 + 4
	#+end_example

**** tests
    #+begin_src lisp :results output :export code :tangle src/tests.lisp
    (let* ((lang (gmpl-language)))
      (progn
        (bformat t "Testing operations in gmpl-language.")
        (generate-code (union-op 'A 'B) lang t) (terpri)
        (generate-code (intersection-op 'A 'B) lang t) (terpri)
        (generate-code (assignment-op 'A 'B) lang t) (terpri)
        (generate-code (difference-op 'A 'B) lang t) (terpri)
        (generate-code (cartesian-product-op 'A 'B) lang t) (terpri)))
    #+end_src

    #+RESULTS:
    : ======================================
    :  Testing operations in gmpl-language.
    : ======================================
    : 
    : A union B
    : A inter B
    : A = B
    : A diff B
    : A cross B

****** tests with sumf
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (let* ((lang (gmpl-language))
             (s-one (set-ref 's-one))
             (node1 (sumf ((i in s-one)) i))
             (node2 (sumf ((i in s-one)
                           (j in s-one))
                          (+ i j)))
             (node3 (sumf ((i in s-one)
                           (< i 5))
                          (+ i 2)))
             )
        (progn
          (bformat t "Testing sum-node in gmpl-language.")
          (generate-code node1 lang t) (terpri)
          (generate-code node2 lang t) (terpri)
          (generate-code node3 lang t) (terpri)
          ))
      #+end_src

      #+RESULTS:
      : ====================================
      :  Testing sum-node in gmpl-language.
      : ====================================
      : 
      : sum {I in S_ONE} I
      : sum {I in S_ONE, J in S_ONE} I + J
      : sum {I in S_ONE, I < 5} I + 2

